#app/constants/club_mapping.py


QUESTION_CLUB_MAP = {

    #예창
     "art_dQ2": {
        0 : 45, #그리고 그림
        1 : 47, #동국서도회
        2 : 48  #동그라미
    },

    "art_dQ3" : {
        0 : 46, #동국 문학회 
        1 : 50 #만화얼
    },

    "art_dQ4" : {
        0 : 49, #디딤돌 
        1 : 51 #애드러쉬
    },

    #공연
    "performance_dQ1" : {
        0 : 11 #HOLA
    },

    "performance_dQ2" : {
        0 : 7, #잼잼
        1 : 1,#극예술연구회
        2 : 12 #LOTUS
    },

    "performance_dQ3" : {
        0 : 13, #ODC
        1 : 2, #두둠칫
    },

    "performance_dQ4" : {
        0 : [3,5,4,6], #목멱성, 아리랑, 뭉게구름, 음샘
        1 : 10, #AJAX
        2 : 8, #피어리스던
    },

    "performance_dQ5" : {
        0 : 14, #OPUS
        1 : 9, #한여울
    },
    
    #사회
    "social_dQ2" : {
        0 : 26, #동불
        1 : 27, #큗
    },
    "social_dQ3" : {
        0 : 28, #프론티어
        1 : 29, #RICH
        2 : 30 #UNSA
   },


    #스포츠
    "sports_dQ1" : {
        0 : 55, #기우회
    },
    "sports_dQ2" : {
        0 : [61,62], #토토, 엘레펜테
        1 : 58, #코티스트
        2 : 63, #L.A.E
        3 : 60, #DUTC
        4 : 59, #터스커스
    },
    
    "sports_dQ3" : {
        0 : 57, #선무부
        1 : 56, #명궁
        2 : 69, #무법
        3 : 54, #검도부
    },

    "sports_dQ4" : {
        0 :  71, #산악부
        1 :  70, #바람소리
        2 :  72, #수중탐험연구회
        3 :  68, #동굴탐험연구회
        4 :  73, #스키부
    },

    #학술
    "study_dQ2" : {
        0 : 37, #멋쟁이사자처럼
        1 : 38, #CAPS
        2 : 39, #DNA
    },

    "study_dQ3" : {
        0 : 36, #맑스철학연구회
        1 : 34, #정치학연구실
        2 : 42, #NSA
    },

    "study_dQ4" : {
        0 : 53, #카페인
        1 : 41, #MECS
    },

    "study_dQ5" : {
        0 : 32, #경영학연구회
        1 : 34, #KCC
        2 : 33, #국제통상학연구실
        3 : 35, #F.O.D.E(경제학연구회)
    },


    #봉사
    "volunteer_dQ1" : {
        0 : 20, #페인터즈
        1 : 21, #푸름누리
        2 : 17, #길
    },

    "volunteer_dQ2" : {
        0 : 22, #한글학교 하람
        1 : 23, #젊은 새이웃 ELF
        2 : 18, #손짓사랑회
    },

    "volunteer_dQ3" : {
        0 : 24, #RCY
        1 : 25, #KUSA
    }
    
}